In [5]:
import numpy as np
import pandas as pd

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})
print('type(df) == {}'.format(type(df)))
print('\n---\n')
print(df)

type(df) == <class 'pandas.core.frame.DataFrame'>

---

       name  math  english  reading
0     Sally    90       82       61
1      Jane    65       89       74
2     Suzie    66       97       88
3     Billy    73       70       92
4       Ada    77       61       66
5      John    91       74       87
6    Thomas    99       87       64
7     Marie    60       67       85
8    Albert    80       93       71
9   Richard    71       78       73
10    Isaac    70       82       74
11     Alan    89       93       70

In [6]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

In [7]:
df.shape

(12, 4)

In [8]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [9]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [10]:
df.columns[1]

'math'

In [12]:
df.columns = ['student_name', 'math_grade', 'eng_grade', 'read_grade']

In [13]:
df

   student_name  math_grade  eng_grade  read_grade
0         Sally          90         82          61
1          Jane          65         89          74
2         Suzie          66         97          88
3         Billy          73         70          92
4           Ada          77         61          66
5          John          91         74          87
6        Thomas          99         87          64
7         Marie          60         67          85
8        Albert          80         93          71
9       Richard          71         78          73
10        Isaac          70         82          74
11         Alan          89         93          70

In [14]:
for col in df:
    print(col)

student_name
math_grade
eng_grade
read_grade

In [16]:
uppercased_cols = []
for col in df:
    uppercased_cols.append(col.upper())
df.columns = uppercased_cols

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
STUDENT_NAME    12 non-null object
MATH_GRADE      12 non-null int64
ENG_GRADE       12 non-null int64
READ_GRADE      12 non-null int64
dtypes: int64(3), object(1)
memory usage: 464.0+ bytes

In [18]:
df

   STUDENT_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
0         Sally          90         82          61
1          Jane          65         89          74
2         Suzie          66         97          88
3         Billy          73         70          92
4           Ada          77         61          66
5          John          91         74          87
6        Thomas          99         87          64
7         Marie          60         67          85
8        Albert          80         93          71
9       Richard          71         78          73
10        Isaac          70         82          74
11         Alan          89         93          70

In [19]:
df[['STUDENT_NAME', 'MATH_GRADE']]

   STUDENT_NAME  MATH_GRADE
0         Sally          90
1          Jane          65
2         Suzie          66
3         Billy          73
4           Ada          77
5          John          91
6        Thomas          99
7         Marie          60
8        Albert          80
9       Richard          71
10        Isaac          70
11         Alan          89

In [20]:
df['STUDENT_NAME']

0       Sally
1        Jane
2       Suzie
3       Billy
4         Ada
5        John
6      Thomas
7       Marie
8      Albert
9     Richard
10      Isaac
11       Alan
Name: STUDENT_NAME, dtype: object

In [21]:
df.STUDENT_NAME

0       Sally
1        Jane
2       Suzie
3       Billy
4         Ada
5        John
6      Thomas
7       Marie
8      Albert
9     Richard
10      Isaac
11       Alan
Name: STUDENT_NAME, dtype: object

In [22]:
df.MATH_GRADE > 60

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8      True
9      True
10     True
11     True
Name: MATH_GRADE, dtype: bool

In [24]:
df[df.MATH_GRADE > 60]

   STUDENT_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
0         Sally          90         82          61
1          Jane          65         89          74
2         Suzie          66         97          88
3         Billy          73         70          92
4           Ada          77         61          66
5          John          91         74          87
6        Thomas          99         87          64
8        Albert          80         93          71
9       Richard          71         78          73
10        Isaac          70         82          74
11         Alan          89         93          70

In [25]:
df.iloc[4:8]

  STUDENT_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
4          Ada          77         61          66
5         John          91         74          87
6       Thomas          99         87          64
7        Marie          60         67          85

In [30]:
df.head(4)

  STUDENT_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
0        Sally          90         82          61
1         Jane          65         89          74
2        Suzie          66         97          88
3        Billy          73         70          92

In [31]:
df.tail(6)

   STUDENT_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
6        Thomas          99         87          64
7         Marie          60         67          85
8        Albert          80         93          71
9       Richard          71         78          73
10        Isaac          70         82          74
11         Alan          89         93          70

In [29]:
df.iloc[4:8, 1:3] #rows, column

   MATH_GRADE  ENG_GRADE
4          77         61
5          91         74
6          99         87
7          60         67

In [33]:
df.sample(7)

   STUDENT_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
11         Alan          89         93          70
1          Jane          65         89          74
8        Albert          80         93          71
5          John          91         74          87
4           Ada          77         61          66
7         Marie          60         67          85
2         Suzie          66         97          88

In [34]:
df.rename(columns={'STUDENT_NAME': 'ST_NAME'})

    ST_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE
0     Sally          90         82          61
1      Jane          65         89          74
2     Suzie          66         97          88
3     Billy          73         70          92
4       Ada          77         61          66
5      John          91         74          87
6    Thomas          99         87          64
7     Marie          60         67          85
8    Albert          80         93          71
9   Richard          71         78          73
10    Isaac          70         82          74
11     Alan          89         93          70

In [35]:
# to change the underlying data frame
df.rename(columns={'STUDENT_NAME': 'ST_NAME'}, inplace=True)

In [36]:
df.T

,0,1,2,3,4,5,6,7,8,9,10,11
ST_NAME,Sally,Jane,Suzie,Billy,Ada,John,Thomas,Marie,Albert,Richard,Isaac,Alan
MATH_GRADE,90,65,66,73,77,91,99,60,80,71,70,89
ENG_GRADE,82,89,97,70,61,74,87,67,93,78,82,93
READ_GRADE,61,74,88,92,66,87,64,85,71,73,74,70

In [38]:
df['average'] = (df.MATH_GRADE + df.READ_GRADE + df.ENG_GRADE) / 3
print(df)

    ST_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE    average
0     Sally          90         82          61  77.666667
1      Jane          65         89          74  76.000000
2     Suzie          66         97          88  83.666667
3     Billy          73         70          92  78.333333
4       Ada          77         61          66  68.000000
5      John          91         74          87  84.000000
6    Thomas          99         87          64  83.333333
7     Marie          60         67          85  70.666667
8    Albert          80         93          71  81.333333
9   Richard          71         78          73  74.000000
10    Isaac          70         82          74  75.333333
11     Alan          89         93          70  84.000000

In [41]:
df.assign(overall_average=(df.MATH_GRADE + df.READ_GRADE + df.ENG_GRADE) / 3)

    ST_NAME  MATH_GRADE  ENG_GRADE  READ_GRADE  overall_average
0     Sally          90         82          61        77.666667
1      Jane          65         89          74        76.000000
2     Suzie          66         97          88        83.666667
3     Billy          73         70          92        78.333333
4       Ada          77         61          66        68.000000
5      John          91         74          87        84.000000
6    Thomas          99         87          64        83.333333
7     Marie          60         67          85        70.666667
8    Albert          80         93          71        81.333333
9   Richard          71         78          73        74.000000
10    Isaac          70         82          74        75.333333
11     Alan          89         93          70        84.000000

In [44]:
def describe_grade(number_grade: int) -> str:
    if number_grade > 90:
        return 'Great!'
    elif number_grade > 70:
        return 'Ok'
    else:
        return 'Uh oh...'
df.MATH_GRADE.apply(describe_grade)

0           Ok
1     Uh oh...
2     Uh oh...
3           Ok
4           Ok
5       Great!
6       Great!
7     Uh oh...
8           Ok
9           Ok
10    Uh oh...
11          Ok
Name: MATH_GRADE, dtype: object

In [62]:
def curve_grade(number_grade: int) -> int:
    new_grade = number_grade + 10
    if new_grade > 100:
        return 100
    else:
        return new_grade

df['curved_math_grade'] = df.MATH_GRADE.apply(curve_grade)

In [63]:
df[[STUDENT_NAME]], 'curved_math_grade', 'mathematics_grade']]

SyntaxError: invalid syntax (<ipython-input-63-4cf96f28a2ea>, line 1)

In [48]:
df.READ_GRADE.apply(lambda grade: 'passing' if grade >= 70 else 'failing')

0     failing
1     passing
2     passing
3     passing
4     failing
5     passing
6     failing
7     passing
8     passing
9     passing
10    passing
11    passing
Name: READ_GRADE, dtype: object

In [53]:
df.READ_GRADE > 70

0     False
1      True
2      True
3      True
4     False
5      True
6     False
7      True
8      True
9      True
10     True
11    False
Name: READ_GRADE, dtype: bool

In [54]:
(df.READ_GRADE > 70).any()

True

In [55]:
(df.READ_GRADE > 70).all()

False

In [56]:
df.ENG_GRADE.mean()

81.08333333333333

In [59]:
df.ST_NAME

0       Sally
1        Jane
2       Suzie
3       Billy
4         Ada
5        John
6      Thomas
7       Marie
8      Albert
9     Richard
10      Isaac
11       Alan
Name: ST_NAME, dtype: object

In [60]:
df.ST_NAME.str.upper()

0       SALLY
1        JANE
2       SUZIE
3       BILLY
4         ADA
5        JOHN
6      THOMAS
7       MARIE
8      ALBERT
9     RICHARD
10      ISAAC
11       ALAN
Name: ST_NAME, dtype: object